function setup() {
  setCanvasContainer('p5-canvas', 3, 2, true);
  background('white');
}

function draw() {
  colorMode(RGB);
  fill(180);
  noStroke();
  rectMode(CORNER);
  background(140);
  //맨위
  fill(200);
  rect(0, 0, 1000, 30);
  //벽 background
  //바닥
  rect(0, 700, 1000, 50);
  //조명
  fill(255, 255, 255, 20);
  circle(500, 320, 100, 100);
  fill(255, 255, 255, 30);
  circle(500, 320, 90, 90);
  fill(255, 255, 255, 50);
  circle(500, 320, 80, 80);
  fill(255, 255, 255, 70);
  circle(500, 320, 70, 70);
  fill(255, 255, 255, 0);
  circle(500, 300, 70, 70);

  //조명 선
  fill(60);
  rect(500, 0, 5, 300);
  //조명 갓
  rectMode(CENTER);
  fill(60);
  rect(500, 300, 150, 70, 10, 10, 10, 10);
  //바닥걸레받이
  rectMode(CORNER);
  fill(80);
  rect(0, 550, 1000, 10);

  //왼쪽 창문
  fill('#636464');
  rect(0, 150, 150, 300);
  //창문 내부
  fill('#5AC5FA');
  rect(0, 170, 130, 220);

  //창문 가로지르기
  fill('#636464');
  rect(0, 280, 150, 10);

  //창문 받이
  fill('#787878');
  rect(0, 380, 170, 15);
  //창문받이 그림자
  fill(60);
  rect(0, 395, 150, 10);
  //커튼 봉
  fill(60);
  rect(0, 170, 170, 5);
  //커튼 봉 동그리
  fill(60);
  circle(173, 173, 10, 10);
  //오른쪽 액자 테두리
  fill('#C7C7C7');
  rect(820, 240, 170, 190);
  //오른쪽 액자
  fill('#FFBA00');
  rect(830, 250, 150, 170);
  //쥐구멍
  fill(40);
  rect(900, 530, 30, 30, 20, 20, 0, 0);
  //탁자
  fill('#B4B4B4');
  rect(280, 450, 450, 10);
  rect(300, 450, 410, 40);
  rect(300, 450, 30, 150);
  rect(680, 450, 30, 150);
  fill(120);
  rect(300, 460, 410, 5);
  //탁자 발
  fill(70);
  rect(305, 600, 20, 5);
  rect(685, 600, 20, 5);
  //의자
  fill('#FF286D');
  rect(230, 500, 350, 10);
  fill('#C7C8C8');
  rect(230, 510, 350, 10);
  rect(250, 510, 20, 100);
  rect(540, 510, 20, 100);
  //의자발
  fill(90);
  rect(255, 610, 12.5, 3);
  rect(545, 610, 12.5, 3);
  //의자2
  fill('#FF286D');
  rect(670, 500, 200, 10);
  fill('#C7C8C8');
  rect(670, 510, 200, 10);
  rect(670, 510, 20, 100);
  rect(850, 510, 20, 100);
  //의자발2
  fill(90);
  rect(675, 610, 12.5, 3);
  rect(855, 610, 12.5, 3);
  //커튼
  fill(255, 255, 255, 90);
  rect(90, 170, 70, 300);
}
